app/views/blog_posts/your_posts.html.erb

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."user_id" = ?  [["user_id", 1]]
---
<% current_user.blog_posts.each do |blog_post| %>