app/controllers/blog_posts_controller.rb

  def index
    @blog_posts = BlogPost.all
---
SELECT "blog_posts".* FROM "blog_posts"

  def create
    @blog_post = BlogPost.new(blog_post_params)

    respond_to do |format|
      if @blog_post.save
---
INSERT INTO "blog_posts" ("title", "author", "blog_entry", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)