app/controllers/comments_controller.rb

INSERT INTO "comments" ("author", "comment_entry", "blog_post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @comment = Comment.create(comment_params)